omakoto/raspberry-pi-pico/nsbackend-esp32s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash Size (XIAO ESP32-S3 standard 8MB Flash)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Custom Partition Table with SPIFFS
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# FreeRTOS 1kHz tick rate for precise sub-millisecond timers
CONFIG_FREERTOS_HZ=1000

# TinyUSB Configuration (1 HID Gamepad Interface)
CONFIG_TINYUSB_HID_COUNT=1

# Networking & Stack sizing
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
